using StaticArrays

𛲜 = 1.6      # weakness
Θ = 1 / 𛲜    # resistance
✗ = Θ^2      # "immunity"
const type_effectiveness = (@SMatrix [# ✴✊✈☠ ⛰ ☗⁂⚰ ⛓ ♨☔✿ ⚡⚛ ❄⛩☽ ❤ ∅
    1 1 1 1 1 Θ 1 ✗ Θ 1 1 1 1 1 1 1 1 1 1                  # normal
    𛲜 1 Θ Θ 1 𛲜 Θ ✗ 𛲜 1 1 1 1 Θ 𛲜 1 𛲜 Θ 1                  # fighting
    1 𛲜 1 1 1 Θ 𛲜 1 Θ 1 1 𛲜 Θ 1 1 1 1 1 1                  # flying
    1 1 1 Θ Θ Θ 1 Θ ✗ 1 1 𛲜 1 1 1 1 1 𛲜 1                  # poison
    1 1 ✗ 𛲜 1 𛲜 Θ 1 𛲜 𛲜 1 Θ 𛲜 1 1 1 1 1 1                  # ground
    1 Θ 𛲜 1 Θ 1 𛲜 1 Θ 𛲜 1 1 1 1 𛲜 1 1 1 1                  # rock
    1 Θ 1 Θ 1 1 1 Θ Θ Θ 1 𛲜 1 𛲜 1 1 𛲜 Θ 1                  # bug
    ✗ 1 1 1 1 1 1 𛲜 1 1 1 1 1 𛲜 1 1 Θ 1 1                  # ghost
    1 1 1 1 1 𛲜 1 1 Θ Θ Θ 1 Θ 1 𛲜 1 1 𛲜 1                  # steel
    1 1 1 1 1 Θ 𛲜 1 𛲜 Θ Θ 𛲜 1 1 𛲜 Θ 1 1 1                  # fire
    1 1 1 1 𛲜 𛲜 1 1 1 𛲜 Θ Θ 1 1 1 Θ 1 1 1                  # water
    1 1 Θ Θ 𛲜 𛲜 Θ 1 Θ Θ 𛲜 Θ 1 1 1 Θ 1 1 1                  # grass
    1 1 𛲜 1 ✗ 1 1 1 1 1 𛲜 Θ Θ 1 1 Θ 1 1 1                  # electric
    1 𛲜 1 𛲜 1 1 1 1 Θ 1 1 1 1 Θ 1 1 ✗ 1 1                  # psychic
    1 1 𛲜 1 𛲜 1 1 1 Θ Θ Θ 𛲜 1 1 Θ 𛲜 1 1 1                  # ice
    1 1 1 1 1 1 1 1 Θ 1 1 1 1 1 1 𛲜 1 ✗ 1                  # dragon
    1 Θ 1 1 1 1 1 𛲜 1 1 1 1 1 𛲜 1 1 Θ Θ 1                  # dark
    1 𛲜 1 Θ 1 1 1 1 Θ Θ 1 1 1 1 1 𛲜 𛲜 1 1                  # fairy
])'
